init.el
;;; -*- lexical-binding: t -*-

(defun tangle-init ()
  "If the current buffer is 'init.org' the code-blocks are
tangled, and the tangled file is compiled."
  (when (equal (buffer-file-name)
               (expand-file-name (concat user-emacs-directory "init.org")))
    ;; Avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file (concat user-emacs-directory "init.el")))))

(add-hook 'after-save-hook 'tangle-init)

(add-hook
 'after-init-hook
 (lambda ()
   (let ((private-file (concat user-emacs-directory "private.el")))
     (when (file-exists-p private-file)
       (load-file private-file))
     (server-start))))

;(lexical-let ((old-gc-treshold gc-cons-threshold))
;  (setq gc-cons-threshold most-positive-fixnum)
;  (add-hook 'after-init-hook
;            (lambda () (setq gc-cons-threshold old-gc-treshold))))

(require 'cl)
(require 'package)
(package-initialize)

(setq package-archives
      '(
        ("gnu" . "https://elpa.gnu.org/packages/")
        ("MELPA Stable" . "https://stable.melpa.org/packages/")
        ("MELPA"        . "https://melpa.org/packages/")
        )
      package-archive-priorities
      '(("MELPA Stable" . 10)
        ("gnu"          . 5)
        ("MELPA"        . 0)
        ))

(let* ((package--builtins nil)
       (packages
        '(auto-compile             ; automatically compile Emacs Lisp libraries
;;             cider                ; Clojure Interactive Development Environment
;;             clj-refactor         ; Commands for refactoring Clojure code
;;             company              ; Modular text completion framework
;;             company-coq          ; A collection of extensions PG's Coq mode
          define-word              ; display the definition of word at point
          diminish                 ; Diminished modes from modeline
          doom-themes              ; An opinionated pack of modern color-themes
          erlang                   ; Erlang major mode
;;             expand-region        ; Increase selected region by semantic units
          focus                    ; Dim color of text in surrounding sections
          git-gutter-fringe        ; Fringe version of git-gutter.el
          golden-ratio             ; Automatic resizing windows to golden ratio
          haskell-mode             ; A Haskell editing mode
          helm                     ; Incremental and narrowing framework
          helm-ag                  ; the silver searcher with helm interface
;;             helm-company         ; Helm interface for company-mode
          helm-dash             ; Offline documentation using Dash docsets.
          helm-projectile       ; Helm integration for Projectile
          helm-swoop            ; Efficiently hopping squeezed lines
          jedi                  ; Python auto-completion for Emacs
          js2-mode              ; Improved JavaScript editing mode
          leuven-theme          ; djl added
          magit                 ; control Git from Emacs
          markdown-mode         ; Emacs Major mode for Markdown-formatted files
;;             maude-mode           ; Emacs mode for the programming language Maude
;;             minizinc-mode        ; Major mode for MiniZinc code
;;             multiple-cursors     ; Multiple cursors for Emacs
;;             olivetti             ; Minor mode for a nice writing environment
          org                    ; Outline-based notes management and organizer
          org-bullets            ; Show bullets in org-mode as UTF-8 characters
          org-ref                ; citations bibliographies in org-mode
          org-super-agenda       ; djl: suggested by Reed
          paredit                ; minor mode for editing parentheses
          pdf-tools              ; Emacs support library for PDF files
          plantuml-mode          ; djl added
          projectile             ; Manage and navigate projects in Emacs easily
;;             proof-general        ; A generic Emacs interface for proof assistants
          racket-mode                   ; Major mode for Racket language
          real-auto-save                ; djl added
;;             slime                ; Superior Lisp Interaction Mode for Emacs
          tango-plus-theme       ; djl added
          try                          ; Try out Emacs packages
          which-key)))                 ; Display available keybindings in popup
  (when (memq window-system '(mac ns))
    (push 'exec-path-from-shell packages)
    (push 'reveal-in-osx-finder packages))
  (let ((packages (remove-if 'package-installed-p packages)))
    (when packages
      ;; Install uninstalled packages
      (package-refresh-contents)
      (mapc 'package-install packages))))

(when (memq window-system '(mac ns))
