init.org
** PDF Tools

   [[https://github.com/politza/pdf-tools][PDF Tools]] makes a huge improvement on the built-in [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Document-View.html][doc-view-mode]]; the only
   drawback is the =pdf-tools-install= (which has to be executed before the
   package can be used) takes a couple of /seconds/ to execute. Instead of
   running it at init-time, we'll run it whenever a PDF is opened. Note that
   it's only slow on the first run!

   #+BEGIN_SRC emacs-lisp
   (add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-tools-install))
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
   (add-hook 'pdf-view-mode-hook
             (lambda () (setq mode-line-format nil)))
   #+END_SRC

** Completion

   [[https://github.com/auto-complete/auto-complete][Auto-Complete]] has been a part of my config for years, but I want to try
   out [[http://company-mode.github.io/][company-mode]]. If I code in an environment with good completion, I've
   made an habit of trying to /guess/ function-names, and looking at the
   completions for the right one. So I want a pretty aggressive completion
   system, hence the no delay settings and short prefix length.

   #+BEGIN_SRC emacs-lisp
   ;; (setq company-idle-delay 0
   ;;       company-echo-delay 0
   ;;       company-dabbrev-downcase nil
   ;;       company-minimum-prefix-length 2
   ;;       company-selection-wrap-around t
   ;;       company-transformers '(company-sort-by-occurrence
   ;;                              company-sort-by-backend-importance))
   #+END_SRC

** Helm

   I've been a long time user of ~ido-mode~ along with ~ido-vertical-mode~, and
   don't have any particular complaints. Though I've got a feeling I'm missing
   out on something by not using [[https://github.com/emacs-helm/helm][helm]]. I will [[http://tuhdo.github.io/helm-intro.html][this excellent tutorial]] as a
   starting point, along with some of the suggested configurations.

   ~helm~ has a wonderful feature, being able to grep files by ~C-s~ anywhere,
   which is useful. [[http://beyondgrep.com/][ack]] is a great ~grep~-replacement, and is designed to
   search source code, so I want to use that if it's available.

   Note that some changes in bindings are located in the key bindings (found
   near the end of the configuration).

   #+BEGIN_SRC emacs-lisp
   (require 'helm)
   (require 'helm-config)
   (setq helm-split-window-in-side-p t
         helm-M-x-fuzzy-match t
         helm-buffers-fuzzy-matching t
         helm-recentf-fuzzy-match t
         helm-move-to-line-cycle-in-source t
         projectile-completion-system 'helm
         helm-mini-default-sources '(helm-source-buffers-list
                                     helm-source-recentf
                                     helm-source-bookmarks
                                     helm-source-buffer-not-found))

   (when (executable-find "ack")
     (setq helm-grep-default-command
           "ack -Hn --no-group --no-color %e %p %f"
           helm-grep-default-recurse-command
           "ack -H --no-group --no-color %e %p %f"))

   (set-face-attribute 'helm-selection nil :background "cyan")

   (helm-mode 1)
   (helm-projectile-on)
   (helm-adaptive-mode 1)
   #+END_SRC

*** Helm dash

    #+BEGIN_SRC emacs-lisp
    (setq helm-dash-browser-func 'eww)
    (add-hook 'emacs-lisp-mode-hook
              (lambda () (setq-local helm-dash-docsets '("Emacs Lisp"))))
    (add-hook 'erlang-mode-hook
              (lambda () (setq-local helm-dash-docsets '("Erlang"))))
    (add-hook 'java-mode-hook
              (lambda () (setq-local helm-dash-docsets '("Java"))))
    (add-hook 'haskell-mode-hook
              (lambda () (setq-local helm-dash-docsets '("Haskell"))))
    (add-hook 'clojure-mode-hook
              (lambda () (setq-local helm-dash-docsets '("Clojure"))))
    #+END_SRC

** Spelling

   Flyspell offers on-the-fly spell checking. We can enable flyspell for all
   text-modes with this snippet.

   #+BEGIN_SRC emacs-lisp
   (add-hook 'text-mode-hook 'turn-on-flyspell)
   #+END_SRC

   To use flyspell for programming there is =flyspell-prog-mode=, that only
   enables spell checking for comments and strings. We can enable it for all
   programming modes using the =prog-mode-hook=.

   #+BEGIN_SRC emacs-lisp
   ;;djl (add-hook 'prog-mode-hook 'flyspell-prog-mode)
   #+END_SRC

   When working with several languages, we should be able to cycle through
   the languages we most frequently use. Every buffer should have a separate
   cycle of languages, so that cycling in one buffer does not change the
   state in a different buffer (this problem occurs if you only have one
   global cycle). We can implement this by using a [[http://www.gnu.org/software/emacs/manual/html_node/elisp/Closures.html][closure]].

   #+BEGIN_SRC emacs-lisp
   (defun cycle-languages ()
     "Changes the ispell dictionary to the first element in
   ISPELL-LANGUAGES, and returns an interactive function that cycles
   the languages in ISPELL-LANGUAGES when invoked."
     (lexical-let ((ispell-languages '#1=("american" "norsk" . #1#)))
       (ispell-change-dictionary (car ispell-languages))
       (lambda ()
         (interactive)
         ;; Rotates the languages cycle and changes the ispell dictionary.
         (ispell-change-dictionary
          (car (setq ispell-languages (cdr ispell-languages)))))))
   #+END_SRC

   =flyspell= signals an error if there is no spell-checking tool is
   installed. We can advice =turn-on-flyspell= and =flyspell-prog-mode= to
   only try to enable =flyspell= if a spell-checking tool is available. Also
   we want to enable cycling the languages by typing =C-c l=, so we bind the
   function returned from =cycle-languages=.

   #+BEGIN_SRC emacs-lisp
   (defadvice turn-on-flyspell (before check nil activate)
     "Turns on flyspell only if a spell-checking tool is installed."
     (when (executable-find ispell-program-name)
       (local-set-key (kbd "C-c l") (cycle-languages))))
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
   ;; (defadvice flyspell-prog-mode (before check nil activate)
   ;;   "Turns on flyspell only if a spell-checking tool is installed."
   ;;   (when (executable-find ispell-program-name)
   ;;     (local-set-key (kbd "C-c l") (cycle-languages))))
   #+END_SRC

** Org

   When editing org-files with source-blocks, we want the source blocks to
   be themed as they would in their native mode.

   #+BEGIN_SRC emacs-lisp
   (setq org-src-fontify-natively t
         org-src-tab-acts-natively t
         org-confirm-babel-evaluate nil
         org-edit-src-content-indentation 0)
   #+END_SRC

   This is quite an ugly fix for allowing code markup for expressions like
   ="this string"=, because the quotation marks causes problems.

   #+BEGIN_SRC emacs-lisp
   (with-eval-after-load 'org
     (setcar (nthcdr 2 org-emphasis-regexp-components) " \t\n,")
     (custom-set-variables `(org-emphasis-alist ',org-emphasis-alist)))
   #+END_SRC

   Enable org-bullets when opening org-files.

   #+BEGIN_SRC emacs-lisp
   (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
   #+END_SRC

