init.org
** Minizinc

   #+BEGIN_SRC emacs-lisp
   (add-to-list 'auto-mode-alist '("\\.mzn\\'" . minizinc-mode))

   (defun minizinc-setup ()
     (let ((command (concat "minizinc " (buffer-file-name) " "))
           (f (concat (file-name-base (buffer-file-name)) ".dzn")))
       (local-set-key (kbd "C-c C-c") 'recompile)
       (setq-local compile-command (concat command (if (file-exists-p f) f "")))))

   (add-hook 'minizinc-mode-hook 'minizinc-setup)
   #+END_SRC

** Coq

   #+BEGIN_SRC emacs-lisp
   ;; (add-hook 'coq-mode-hook #'company-coq-mode)
   #+END_SRC

* Key bindings

  Inspired by [[http://stackoverflow.com/questions/683425/globally-override-key-binding-in-emacs][this StackOverflow post]] I keep a =custom-bindings-map= that
  holds all my custom bindings. This map can be activated by toggling a
  simple =minor-mode= that does nothing more than activating the map. This
  inhibits other =major-modes= to override these bindings. I keep this at
  the end of the init-file to make sure that all functions are actually
  defined.

  #+BEGIN_SRC emacs-lisp
  (defvar custom-bindings-map (make-keymap)
    "A keymap for custom bindings.")
  #+END_SRC

** Bindings for [[https://github.com/abo-abo/define-word][define-word]]

   #+BEGIN_SRC emacs-lisp
   (define-key custom-bindings-map (kbd "C-c D") 'define-word-at-point)
   #+END_SRC

** Bindings for [[https://github.com/magnars/expand-region.el][expand-region]]

   #+BEGIN_SRC emacs-lisp
   (define-key custom-bindings-map (kbd "C->")  'er/expand-region)
   (define-key custom-bindings-map (kbd "C-<")  'er/contract-region)
   #+END_SRC

** Bindings for [[https://github.com/magnars/multiple-cursors.el][multiple-cursors]]

   #+BEGIN_SRC emacs-lisp
                                           ;  (define-key custom-bindings-map (kbd "C-c e")  'mc/edit-lines)
                                           ;  (define-key custom-bindings-map (kbd "C-c a")  'mc/mark-all-like-this)
                                           ;  (define-key custom-bindings-map (kbd "C-c n")  'mc/mark-next-like-this)
   #+END_SRC

** Bindings for [[http://magit.github.io][Magit]]

   #+BEGIN_SRC emacs-lisp
   (define-key custom-bindings-map (kbd "C-c m") 'magit-status)
   #+END_SRC

** Bindings for [[http://company-mode.github.io/][company-mode]]

   #+BEGIN_SRC emacs-lisp
   ;; (define-key company-active-map (kbd "C-d") 'company-show-doc-buffer)
   ;; (define-key company-active-map (kbd "C-n") 'company-select-next)
   ;; (define-key company-active-map (kbd "C-p") 'company-select-previous)
   ;; (define-key company-active-map (kbd "<tab>") 'company-complete)

   ;; (define-key company-mode-map (kbd "C-:") 'helm-company)
   ;; (define-key company-active-map (kbd "C-:") 'helm-company)
   #+END_SRC

** Bindings for [[http://emacs-helm.github.io/helm/][Helm]]

   #+BEGIN_SRC emacs-lisp
   (define-key helm-map            (kbd "<tab>")   'helm-execute-persistent-action)
   (define-key helm-map            (kbd "C-i")     'helm-execute-persistent-action)
   (define-key helm-map            (kbd "C-z")     'helm-select-action)
   (define-key helm-map            (kbd "<left>")  'helm-previous-source)
   (define-key helm-map            (kbd "<right>") 'helm-next-source)
   (define-key custom-bindings-map (kbd "C-c h")   'helm-command-prefix)
   (define-key custom-bindings-map (kbd "M-x")     'helm-M-x)
   (define-key custom-bindings-map (kbd "M-y")     'helm-show-kill-ring)
   (define-key custom-bindings-map (kbd "C-x b")   'helm-mini)
   (define-key custom-bindings-map (kbd "C-x C-f") 'helm-find-files)
   (define-key custom-bindings-map (kbd "C-c h d") 'helm-dash-at-point)
   (define-key custom-bindings-map (kbd "C-c h o") 'helm-occur)
   (define-key custom-bindings-map (kbd "C-c h g") 'helm-google-suggest)
   (define-key custom-bindings-map (kbd "M-i")     'helm-swoop)
   (define-key custom-bindings-map (kbd "M-I")     'helm-multi-swoop-all)
   #+END_SRC

** Bindings for [[https://github.com/bbatsov/projectile][Projectile]]

   #+BEGIN_SRC emacs-lisp
   (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
   #+END_SRC

** Bindings for [[https://github.com/clojure-emacs/cider][Cider]]

   #+BEGIN_SRC emacs-lisp
   (with-eval-after-load 'cider
     (define-key cider-repl-mode-map (kbd "C-l") 'cider-repl-clear-buffer))
   #+END_SRC

** Bindings for built-ins

   #+BEGIN_SRC emacs-lisp
   (define-key custom-bindings-map (kbd "M-u")         'upcase-dwim)
   (define-key custom-bindings-map (kbd "M-c")         'capitalize-dwim)
   (define-key custom-bindings-map (kbd "M-l")         'downcase-dwim)
   (define-key custom-bindings-map (kbd "M-]")         'other-frame)
   (define-key custom-bindings-map (kbd "C-j")         'newline-and-indent)
   (define-key custom-bindings-map (kbd "C-c s")       'ispell-word)
;;   (define-key comint-mode-map     (kbd "C-l")         'clear-comint)
   #+END_SRC

** Bindings for functions defined [[sec:defuns][above]].

   #+BEGIN_SRC emacs-lisp
   (define-key global-map          (kbd "M-p")     'jump-to-previous-like-this)
   (define-key global-map          (kbd "M-n")     'jump-to-next-like-this)
   (define-key custom-bindings-map (kbd "M-,")     'jump-to-previous-like-this)
   (define-key custom-bindings-map (kbd "M-.")     'jump-to-next-like-this)
   (define-key custom-bindings-map (kbd "C-c .")   (cycle-themes))
   (define-key custom-bindings-map (kbd "C-x k")   'kill-this-buffer-unless-scratch)
   (define-key custom-bindings-map (kbd "C-c C-0") 'global-scale-default)
   (define-key custom-bindings-map (kbd "C-c C-=") 'global-scale-up)
   (define-key custom-bindings-map (kbd "C-c C-+") 'global-scale-up)
   (define-key custom-bindings-map (kbd "C-c C--") 'global-scale-down)
   (define-key custom-bindings-map (kbd "C-c j")   'cycle-spacing-delete-newlines)
   (define-key custom-bindings-map (kbd "C-c d")   'duplicate-thing)
   (define-key custom-bindings-map (kbd "<C-tab>") 'tidy)
   (define-key custom-bindings-map (kbd "M-`")     'toggle-shell)
   (dolist (n (number-sequence 1 9))
     (global-set-key (kbd (concat "M-" (int-to-string n)))
                     (lambda () (interactive) (switch-shell n))))
   (define-key custom-bindings-map (kbd "C-c C-q")
     '(lambda ()
        (interactive)
        (focus-mode 1)
        (focus-read-only-mode 1)))
   (with-eval-after-load 'org
     (define-key org-mode-map (kbd "C-'") 'org-sync-pdf))
   #+END_SRC

   Lastly we need to activate the map by creating and activating the
   =minor-mode=.

   #+BEGIN_SRC emacs-lisp
   (define-minor-mode custom-bindings-mode
     "A mode that activates custom-bindings."
     t nil custom-bindings-map)
   #+END_SRC
* Derrell's traditional stuff
** startup.el
   #+BEGIN_SRC emacs-lisp
                                           ;    (setq emacs-local-directory "/home/derrell/ME/xemacs-lib/site-lisp")

   (setenv "SHELL" "/bin/csh")

                                           ;    (nconc load-path (list emacs-local-directory))

                                           ; Use js2 mode for JavaScript files
                                           ;
                                           ; TO RETRIEVE THE LATEST js2-mode:
                                           ;   M-x package-install RET js2-mode RET
                                           ;
                                           ; which installs it in ~/.emacs.d
   (add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))

   (load "hexl")                ; hex editor for binary files
   (require 'linum)

                                           ; load parenthesis matching stuff
   (load "paren")

                                           ;    (load "kb-generic")

                                           ; Display time in mode line
   (display-time)

                                           ; Reset modeline-format to have time and mail flag first on mode line
   (setq-default modeline-format '(" %* " global-mode-string " %n  " mode-line-buffer-identification "  " (-3 . "%p") "  %f  %[(" mode-name mode-line-process ")%]  %-"))

                                           ; Only display 24-hour time
   (setq display-time-form-list (list '24-hours 'minutes))

   (put 'eval-expression 'disabled nil)
   (put 'narrow-to-region 'disabled nil)
   (put 'upcase-region 'disabled t)
   #+END_SRC

