init.el

(defun command-history-hooker ()
  (define-key command-history-map "n" 'next-line)
  (define-key command-history-map "p" 'previous-line))

(defun dired-mode-hooker ()
  (define-key dired-mode-map "!" 'dired-shell-command)
  (define-key dired-mode-map "c" 'dired-do-copy)
  (define-key dired-mode-map "r" 'dired-do-rename)
  (setq dired-mode-hook nil))  ; All fixes are global

(defun edit-picture-hooker ()
  (setq picture-tab-chars "!_~-|")  ; Added some useful characters here
  (keybind-edit-picture-hooker)
  (setq edit-picture-hook nil))  ; All fixes are global

                                        ; Underscores and hash marks in running text are usually in C tokens
(defun nroff-mode-hooker ()
  (modify-syntax-entry ?_ "w")
  (modify-syntax-entry ?# "w"))

(defun c-mode-hooker ()
  (define-key c-mode-map "\M-{"         'insert-braces)
  (define-key c-mode-map "\M-\C-h"   'backward-kill-word)
  (if (string-equal
       (substring (buffer-file-name) 0 25)
       "/var/home/derrell/agranat")
      (c-set-style "virata")
    (c-set-style "Derrell-C")))

(defun c++-mode-hooker ()
  (define-key c++-mode-map "\M-{" 'insert-braces)
  (c-set-style "Derrell-C"))

(defun js-mode-hooker ()
      ;;; js2-mode key bindings
  (auto-fill-mode 0)         ; no auto-fill mode in shell mode
  (define-key js2-mode-map "\M-{"
    (lambda (arg)
      (interactive "P")
      (progn
        (insert ?\{)
        (js2-indent-line)
        (save-excursion
          (newline-and-indent)
          (insert ?\})
          (js2-indent-line))
        (newline-and-indent))))
  (setq Local-map-js2 (make-keymap))
  (define-key js2-mode-map        "\C-q"  Local-map-js2)
  (define-key Local-map-js2 "\C-F" '(lambda (arg)
                                      (interactive "P")
                                      (if (and arg (integerp arg))
                                          (c-forward-function arg)
                                        (c-forward-function 4))))
  (define-key Local-map-js2 "\C-B" '(lambda (arg)
                                      (interactive "P")
                                      (if (and arg (integerp arg))
                                          (c-backward-function arg)
                                        (c-backward-function 4)))))

(defun java-mode-hooker ()
  (c-set-style "java")
  (setq c-basic-offset 2)
  (c-set-offset `substatement-open 0)

  (define-key java-mode-map "\M-{"         'insert-braces)
  (define-key java-mode-map "\M-\C-h"    'backward-kill-word))

(defun text-mode-hooker ()
  (if (or (equal (buffer-name) "makefile")
          (equal (buffer-name) "Makefile"))
      nil                ; don't turn on FILL if its a makefile.
    (turn-on-auto-fill)))

(defun find-file-hooker ()
  (kill-local-variable 'case-fold-search))

(defun blink-paren-hooker ()
  "If cursor is already on a matching right delimiter,
       don't insert another one. Blink the match; move the cursor forward."
  (if (looking-at (char-to-string last-input-char))
      (if insert-mode (delete-char 1)))
  (blink-matching-open))

(defun lisp-interaction-mode-hooker ()
  (keybind-lisp-interaction-mode-hooker))

(defun shell-mode-hooker ()
  (auto-fill-mode 0)         ; no auto-fill mode in shell mode
  (setq truncate-lines nil)  ; wrap, don't truncate
  (define-key shell-mode-map "\t"   'comint-dynamic-complete)
  (define-key shell-mode-map "\C-Ch" 'comint-display-command-history)
  (kb-generic-shell-mode-hooker)
  (keybind-shell-mode-hooker))

(defun shell-selected-hooker ()
  (company-mode 0) ; added for Lars' stuff
  (setq modeline-buffer-identification
        '("%13b") modeline-format '("" global-mode-string
                                    " %n "
                                    modeline-buffer-identification "%p  %[("
                                    mode-name mode-line-process ")%]  "
                                    " %-")))
