init.org
** localconfig.el
   #+BEGIN_SRC emacs-lisp
   ;;; New emacs version 19 stuff

   ;; choose syntax display type from:
   ;;    "color", "font", "none"
   (defvar syntax-display-type "color")

   ;; find out who is running this
   (setq user (getenv "USER"))

   ;; Determine default fill-column dynamically
   (setq-default default-fill-column (- (frame-width) 2))

   ;;; leave regions active always (without highlighting)
   ;(setq zmacs-regions nil)

   ;; For Scott Lawrence... don't insert tabs
   (setq-default indent-tabs-mode nil)

   ;; add the host name to the frame title
   ;;(setq frame-title-format (concat "{" (exec-to-string "hostname -s | tr -d \\\\012") "} %S: %b"))

   ;;; cc-mode (and c-mode) stuff
   (c-add-style
    "Derrell-C"
    '((c-basic-offset . 4)
      (c-hanging-comment-ender-p . nil)
      (c-offsets-alist . (
                          (defun-block-intro     . +)
                          (substatement-open     . 0)
                          ))))

   (c-add-style
    "qooxdoo"
    '((c-basic-offset . 2)
      (c-hanging-comment-ender-p . nil)
      (c-offsets-alist . (
                          (defun-block-intro     . +)
                          (class-close           . -)
                          (substatement-open     . 0)
                          ))))

   (c-add-style
    "derrell-java"
    '((c-basic-offset . 2)
      (c-comment-only-line-offset 0 . 0)
      (c-hanging-braces-alist
       (substatement-open before after)
       (arglist-cont-nonempty))
      (c-offsets-alist
       (defun-block-intro     . -)
       (block-intro           . +)
       (substatement-open     . 0)
       (inline-open           . 0)
       (statement-block-intro . 0)
       (knr-argdecl-intro . 5)
       (substatement-label . 0)
       (label . 0)
       (statement-case-open . +)
       (statement-cont . +)
       (arglist-intro . c-lineup-arglist-intro-after-paren)
       (arglist-close . c-lineup-arglist)
       (brace-list-open . +)
       (topmost-intro-cont first c-lineup-topmost-intro-cont c-lineup-gnu-DEFUN-intro-cont))
      (c-special-indent-hook . c-gnu-impose-minimum)
      (c-block-comment-prefix . "")))


   ;; (setq
   ;;  c-macro-preprocessor            "/usr/libexec/cpp"
   ;;  c-macro-prompt-flag         t
   ;;  )


   ;;; End of new stuff for version 19

   (setq

    ;; Automatic backup parameters
    version-control             t
    delete-old-versions         t
    kept-old-versions           0 ; formerly 1
    kept-new-versions           2
    auto-save-interval          100

    ;; Hooks
    text-mode-hook              'text-mode-hooker
    nroff-mode-hook             'nroff-mode-hooker
    blink-paren-function        'blink-matching-open
    asn-mode-hook               'asn-mode-hooker
    find-file-hooks             (list 'find-file-hooker)
    mail-mode-hook              'mail-mode-hooker
    mail-setup-hook             'mail-setup-hooker
    shell-mode-hook             (list 'shell-mode-hooker)
    shell-selected-hook         'shell-selected-hooker
    c-mode-hook                 'c-mode-hooker
    c++-mode-hook               'c++-mode-hooker
    js2-mode-hook               'js-mode-hooker
    java-mode-hook              'java-mode-hooker
    dired-mode-hook             'dired-mode-hooker
    command-history-hook        'command-history-hooker
    ;; lisp-interaction-mode-hook     'lisp-interaction-mode-hooker



    ;; Loose ends
    display-time-interval           10
    default-major-mode              'text-mode
    require-final-newline           t
    scroll-step                     1
    window-min-height               1   ; Enough to watch compilation
    inhibit-startup-message         t   ; Start with shell window
    default-fill-column             70
    term-file-prefix                nil
    keybind-term-file-prefix        "term/kb-"
    dired-listing-switches          "-al"
    display-time-day-and-date       t

    completion-ignored-extensions       '(
                                         ".o"
                                         ".obj"
                                         ".elc"
                                         "~"
                                         ".ln"
                                         ".class")

    ;; C-mode stuff especially automatic indenting of C programs
    c-default-variable-column       16

    ;; Misc. make stuff
    compile-command                 "make"

    ;; Shell stuff
    explicit-shell-file-name        "/bin/csh"
    shell-file-name                 "/bin/csh"
    shell-cd-regexp                 "cd"
    shell-popd-regexp               "popd\\|\-"
    shell-pushd-regexp              "pd\\|pushd\\|\="
    shell-prompt-pattern            "^.*---> \\|(.*-gdb) "

    ;; Don't invert foreground/background to get a password
    passwd-invert-frame-when-keyboard-grabbed nil

    ;; Don't display ssh pass phrase
    comint-password-prompt-regexp
    (concat
     "\\("

     "\\(\\([Oo]ld \\|[Nn]ew \\|[a-zA-Z0-9]+@[a-zA-Z0-9.]+'s |^\\)?"
     "[Pp]assword\\|pass phrase\\)"

     "\\|"
     "\\(Enter passphrase\\( for.*key '[^']+'\\)?\\)"

     "\\|"
     "\\(\\[sudo\\] password for [a-zA-Z0-9]+\\)"

     "\\)"
     ":\\s *\\'")

    ;; Post-script printing
    ps-paper-type               'letter
    )


   (setq-default
    track-eol               nil
    mode-line-buffer-identification '(1 . "%b")
    fill-column             70
    )

   ;;;
   ;;; Enable modes
   ;;;
                                           ;(resize-minibuffer-mode)
   (icomplete-mode t)

   ;;(setq-default
   ;; This, rather than "%b" in format, lets RNEWS and others have their way
   ;; mode-line-format '(
   ;;                    " %*"          minor-mode-alist
   ;;                    "%n  "         mode-line-buffer-identification
   ;;                    "  "           (-3 . "%p")
   ;;                    "  %f  %[("    mode-name mode-line-process
   ;;                    ")%]  "        global-mode-string
   ;;                    " %-"
   ;;                    )
   ;; )

   (defvar compilation-error-regexp
     "\\([^ \n]+\\(: *\\|, line \\|(\\)[0-9]+\\)\\|\\([0-9]+.*of *[^ \n]+\\)\\|\\(used inconsistently\\)"
     "Regular expression for filename/linenumber in error in compilation log.")

   (make-variable-buffer-local 'track-eol)

   ;;; Re-define some font-lock functions since they screw us up.
   (defun font-lock-use-default-fonts ()
     "Reset the font-lock faces to a default set of fonts."
     (interactive)
     ;;  (font-lock-copy-face 'italic 'font-lock-comment-face)
     ;;  ;; Underling comments looks terrible on tty's
     ;;  (set-face-underline-p 'font-lock-comment-face nil 'global 'tty)
     ;;  (set-face-highlight-p 'font-lock-comment-face t 'global 'tty)
     ;;  (font-lock-copy-face 'font-lock-comment-face 'font-lock-string-face)
     ;;  (font-lock-copy-face 'font-lock-string-face 'font-lock-doc-string-face)
     ;;  (font-lock-copy-face 'bold-italic 'font-lock-function-name-face)
     ;;  (font-lock-copy-face 'bold 'font-lock-keyword-face)
     ;;  (font-lock-copy-face 'bold 'font-lock-preprocessor-face)
     ;;  (font-lock-copy-face 'italic 'font-lock-type-face)
     ;;  ;; is this necessary?
     ;;  (remove-hook 'font-lock-mode-hook 'font-lock-use-default-fonts)
     nil)

   (defun font-lock-use-default-colors ()
     "Reset the font-lock faces to a default set of colors."
     (interactive)
     ;;  (font-lock-copy-face 'default 'font-lock-comment-face)
     ;;  (font-lock-set-foreground "#6920ac" 'font-lock-comment-face)
     ;;  (font-lock-copy-face 'default 'font-lock-string-face)
     ;;  (font-lock-set-foreground "green4" 'font-lock-string-face)
     ;;  (font-lock-copy-face 'default 'font-lock-doc-string-face)
     ;;  (font-lock-set-foreground "green4" 'font-lock-doc-string-face)
     ;;  (font-lock-copy-face 'default 'font-lock-function-name-face)
     ;;  (font-lock-set-foreground "red3" 'font-lock-function-name-face)
     ;;  (font-lock-copy-face 'default 'font-lock-keyword-face)
     ;;  (font-lock-set-foreground "blue3" 'font-lock-keyword-face)
     ;;  (font-lock-copy-face 'default 'font-lock-preprocessor-face)
     ;;  (font-lock-set-foreground "blue3" 'font-lock-preprocessor-face)
     ;;  (font-lock-copy-face 'default 'font-lock-type-face)
     ;;  (font-lock-set-foreground "blue3" 'font-lock-type-face)
     ;;  ;; is this necessary?
     ;;  (remove-hook 'font-lock-mode-hook 'font-lock-use-default-colors)
     nil)
   #+END_SRC

