init.org
** c-stuff.el

   #+BEGIN_SRC emacs-lisp
   (setq c-variable-column c-default-variable-column)

   (defun c-indent-variable ()
     (interactive)
     (expand-abbrev)
     (let (begin end indentation)
       (end-of-line)
       (setq end (point))
       (beginning-of-line)
       (setq begin (point))
       (if (search-forward ";" end t)
           (progn
             (backward-char 1)
             (skip-chars-backward "*])a-zA-Z0-9_([" begin)
             (just-one-space)
             (kill-line)
             (indent-to (+ (current-indentation) c-variable-column))
             (setq indentation (point-marker))
             (yank)
             (goto-char indentation))
         (end-of-line)
         (delete-horizontal-space)
         (indent-to (+ (current-indentation) c-variable-column)))))

   (defun c-set-variable-column (arg)
     "Set the column to which variables will be indented.
   With no arg, set the variable column to the current column.
   With any arg, set variable column to specified numeric argument."
     (interactive "P")
     (if arg
         (if (>= (prefix-numeric-value arg) 0)
             (setq c-variable-column (prefix-numeric-value arg))
           (setq c-variable-column c-default-variable-column))
       (setq c-variable-column (- (current-column) (current-indentation))))
     (message "Variable column set to %d" c-variable-column))

   (defun c-forward-function(arg)
     "Move to beginning of the next C function."

     (interactive "P")
     (let* ((pos (point))
            (brace-offset
             (if arg
                 arg
               (c-get-offset '(defun-open . nil))))
            (leading-white-space (make-string brace-offset ?\ ))
            (search-string (concat "^" leading-white-space "{")))
       (forward-char)
       (if (not (re-search-forward search-string (point-max) t))
           (progn
             (beep)
             (goto-char pos))
         (backward-char))))

   (defun c-backward-function(arg)
     "Move to beginning of the previous C function."

     (interactive "P")
     (let* ((brace-offset
             (if arg
                 arg
               (c-get-offset '(defun-open . nil))))
            (leading-white-space (make-string brace-offset ?\ ))
            (search-string (concat "^" leading-white-space "{")))
       (if (not (re-search-backward search-string (point-min) t))
           (beep)
         (forward-char brace-offset))))


   (defun strip-leading-white-space ()
     (interactive)
     (save-excursion
       (beginning-of-line)
       (delete-horizontal-space)
       (while (not (eobp))
         (next-line 1)
         (beginning-of-line)
         (delete-horizontal-space)
         (end-of-line))))


   (defun insert-braces (arg)
     "Put braces around next ARG lines.  Leave point at end of last line.
   No argument is equivalent to zero: just insert {} and leave point between."
     (interactive "P")
     (if arg
         (let* ((odot (point)))
           (insert ?\{)
           (insert ?\n)
           (next-line (prefix-numeric-value arg))
           (insert ?\})
           (insert ?\n)
           (indent-region odot (point) nil)
           (next-line -2)
           (end-of-line))
       (progn
         (insert ?\{)
         (c-indent-command)
         (save-excursion
           (newline-and-indent)
           (insert ?\})
           (c-indent-command))
         (newline-and-indent))))


   (defun insert-braces-around-lines (arg)
     "Put braces around next ARG lines.  Leave point at end of last line."
     (interactive "P")
     (let* ((odot (point)))
       (insert ?\{)
       (insert ?\n)
       (if arg
           (next-line (prefix-numeric-value arg))
         (next-line 1))
       (insert ?\})
       (indent-region odot (point) nil)
       (next-line -1)
       (end-of-line)))




   ;;; C Comment Edit
   ;;; Copyright (C) 1987 Kyle E. Jones
   ;;;
   ;;; This software may be redistributed provided this notice appears on all
   ;;; copies and that the further free redistribution of this software is not
   ;;; restricted in any way.
   ;;;
   ;;; This software is distributed 'as is', without warranties of any kind.

   (defconst c-comment-leader-regexp
     "^[ \t]*\\(/\\*\\*\\|/\\*\\|\\*/\\|\\*\\|\\*\\*\\)[ ]?"
     "Regexp used to match C comment leaders.")

   (defvar c-comment-edit-mode 'indented-text-mode
     "*Mode used by (c-comment-edit) when editing C comments.")

   (defvar c-comment-leader " *"
     "*Leader used when rebuilding edited C comments.  The value of this variable should be a two-character string.  Values of \"  \", \" *\" and \"**\" produce the comment styles:
           /*   /*  /*
                    ,*  **
                    ,*  **
           ,*/   */ */
   respectively.")

   (defconst c-comment-doxygen-leader-regexp "^[ \t]*[@\\]"
     "Regexp used to locate any doxygen command.")

   (defvar kill-c-comment-edit-buffer nil)

   (defun c-comment-edit (create)
     "Edit multi-line C comments.
   This command allows the easy editing of a multi-line C comment like this:
      /*
       ,* ...
       ,* ...
       ,*/
   The comment may be indented or flush with the left margin.

   When invoked with point inside a C comment, this function copies the comment
   into a \"*C Comment Edit*\" buffer, strips the comment leaders and delimiters,
   and performs a recursive-edit on the resulting buffer.  The major mode of this
   buffer is controlled by the variable `c-comment-edit-mode'.

   Use the `exit-recursive-edit' command once you have finished editing the
   comment.  The comment will be inserted into the original buffer
   with the appropriate delimiters, replacing the old version of the comment.
   If you don't want your edited version of the comment to replace the original,
   use the `abort-recursive-edit' command.

   Prefix arg or first arg non-nil means to create an empty C comment at point
   and then edit that."
     (interactive "*P")
     (let ((indention (current-indentation))
           start end odot comment-size comment-fill-column lead-in-string
           (c-buffer (current-buffer)))
       (save-excursion
         (save-window-excursion
           (cond (create (insert "/*\n*/")(backward-char 3)(c-indent-command)))
                                           ;    (if (and (not (eq indention t)) (not create))
                                           ;        (error "Not within a comment."))
           ;; figure out where the comment begins and ends
           (setq odot (point))
           (search-backward "/*" (point-min))
           (setq comment-fill-column (- 75 (current-column)))
           (setq start (point))
           (goto-char odot)
           (search-forward "*/" (point-max))
           (setq end (point))
           ;; copy the comment to the comment-edit buffer
           (copy-to-buffer "*C Comment Edit*" start end)
           ;; select this buffer for editing
           (switch-to-buffer-other-window "*C Comment Edit*")
           ;; untabify the comment since it won't line up properly without
           ;; leaders and delimiters.
           (untabify (point-min) (point-max))
           ;; mark cursor position since we're going to delete things.
           (goto-char (+ (- odot start) 1))
           (push-mark (point) 'quiet)
           (goto-char (point-min))
           ;; remove the leaders and delimiters
           (while (re-search-forward c-comment-leader-regexp (point-max) t)
             (replace-match "" nil t) (forward-line 1))
           ;; run appropriate major mode
           (funcall c-comment-edit-mode)
           (setq fill-column comment-fill-column)
           (goto-char (point-min))
           ;; delete one leading newline
           (if (looking-at "[ \n]")
               (delete-char 1))
           ;; restore cursor
           (pop-mark)
           (goto-char (mark))
           ;; creation is modification, no?
           (set-buffer-modified-p create)
           ;; edit the comment
                                           ;    (message
                                           ;     (substitute-command-keys
                                           ;      "Type \\[exit-recursive-edit] to end edit, \\[abort-recursive-edit] to abort with no change."))
           (message
            "Type M-C-C to end edit, C-] to abort with no change.")
           (recursive-edit)
           ;; in case the user wandered elsewhere
           (switch-to-buffer-other-window "*C Comment Edit*")
           (cond
            ((buffer-modified-p)
                                           ; rebuild the comment

             ;; untabify the comment since it won't line up properly without
             ;; leaders and delimiters.
             (untabify (point-min) (point-max))

             (goto-char (point-min))
             ;; determine if there are any doxygen elements in the comment
             (setq lead-in-string "/*\n")
             (if (re-search-forward c-comment-doxygen-leader-regexp (point-max) t)
                 (setq lead-in-string "/**\n"))
             (goto-char (point-min))
             (insert lead-in-string)
             (while (not (eobp))
               (insert c-comment-leader (if (eolp) "" " "))
               (forward-line 1))
             (insert (cond
                      ((string= c-comment-leader " *") " */")
                      (t "*/")))

             ;; re-tabify the comment.
                                           ; (tabify (point-min) (point-max))
             ;; replace the old comment with the new

             (setq comment-size (buffer-size))
             (switch-to-buffer c-buffer)
             (delete-region start end)
             (goto-char start)
             (insert-buffer-substring "*C Comment Edit*")
             (goto-char start)
             ;; if inserting at other than column 0 we gotta indent, too
             (if (not (zerop (current-column)))
                 (progn
                   (message "Indenting...")
                   (indent-region start (+ start comment-size) nil)
                   (message "Done."))))
            (t (message "No change.")))
           (if kill-c-comment-edit-buffer
               (kill-buffer "*C Comment Edit*")
             (bury-buffer "*C Comment Edit*"))))
       ;; save-excursion can't recover point if we deleted things
       (goto-char odot)))
   #+END_SRC

