init.org
** kb-generic.el

   #+BEGIN_SRC emacs-lisp
      ;;;
      ;;; Function keybind-init will get redefined by the real terminal
      ;;; code in the term directory.
      ;;;

      ;; We define VM stuff in this file, but it may not yet be loaded
                                              ;(require 'vm)

      (defun keybind-init ()
        (interactive)
        (keybind-local-mods)
        (keybind-local-alt-mods)

        ;;;
        ;;; Thanks to http://www.emacswiki.org/emacs/CopyAndPaste
        ;;; Make emacs use the X11 clipboard
        ;;;

        (transient-mark-mode 1)    ; Now on by default: makes the region act quite
                                              ; like the text "highlight" in many apps.  (setq
        ;; shift-select-mode t)    ; Now on by default: allows shifted cursor-keys to
                                              ; control the region.
        (setq mouse-drag-copy-region nil)  ; stops selection with a mouse being
                                              ; immediately injected to the kill ring
        (setq select-enable-primary nil)  ; stops killing/yanking interacting
                                              ; with primary X11 selection
        (setq select-enable-clipboard t)  ; makes killing/yanking interact with
                                              ; clipboard X11 selection

                                              ; You need an emacs with bug #902 fixed for this to work properly. It has
                                              ; now been fixed in CVS HEAD.  it makes "highlight/middlebutton" style (X11
                                              ; primary selection based) copy-paste work as expected if you're used to
                                              ; other modern apps (that is to say, the mere act of highlighting doesn't
                                              ; overwrite the clipboard or alter the kill ring, but you can paste in
                                              ; merely highlighted text with the mouse if you want to)
        (setq select-active-regions t) ;  active region sets primary X11 selection
        (global-set-key [mouse-2] 'mouse-yank-primary)  ; make mouse middle-click
                                              ; only paste from primary
                                              ; X11 selection, not
                                              ; clipboard and kill ring.

        ;; with this, doing an M-y will also affect the X11 clipboard, making emacs
        ;; act as a sort of clipboard history, at least of text you've pasted into
        ;; it in the first place.
                                              ; (setq yank-pop-change-selection t) ; makes rotating the kill ring change
                                              ; the X11 clipboard.


        )

      (defun keybind-shell-mode-hooker ()
        nil)

      (defun keybind-lisp-interaction-mode-hooker ()
        nil)

      (defun keybind-local-mods ()
        (interactive)

        ;; Improved rules for matching delimiters; overridden within C mode
        (global-set-key ")" 'right-delimiter)
        (global-set-key "}" 'right-delimiter)
        (global-set-key "]" 'right-delimiter)

        ;; Users asked for these safety features
        (global-set-key "\C-xf" 'funcs-ctl-x-f-sorry)
        (global-set-key "\C-w"  'funcs-ctl-w-sorry))

      (defun keybind-local-alt-mods ()
        (interactive)

        ;; re-assign some common keys I like to use
        (global-set-key "\C-M" 'newline-and-indent)
        (global-set-key "\C-J" 'newline)
        (global-set-key "\C-N" 'next-line)
        (global-set-key "\C-H" 'delete-backward-char)  ; actually reassigning DEL
        (global-set-key "\C-R" 'scroll-down)
        (global-set-key "\C-X\C-C" 'confirm-exit-emacs)
        (global-set-key "\C-X\C-N" 'next-file)
        (global-set-key "\C-X\C-T" 'visit-tags-table)
        (global-set-key "\C-X\C-M" 'run-make)
        (global-set-key "\C-Xm" 'compile)
        (global-set-key "\C-Xk" 'kill-buffer-and-delete-auto-save)
        (global-set-key "\C-X\C-K" 'kill-compilation)
        (global-set-key "\C-C;" 'comment-region)
        (global-set-key "\M-#" 'help-command)
        (global-set-key "\M-:" 'c-comment-edit)
        (global-set-key "\M-\C-h" 'backward-kill-word)
                                              ;  (global-set-key "\C-X\eh" 'list-command-history)
        (fset 'help-command help-map)

        ;; define a set of local (to me) keys which begin with the prefix Cntrl-Q
        (setq Local-map (make-keymap))
        (define-key Local-map "." 'set-fill-prefix-all-blanks)
        (define-key Local-map "a" 'set-current-add-number)
        (define-key Local-map "b" 'bury-buffer)
        (define-key Local-map "c" 'set-local-case-fold-search)
        (define-key Local-map "C" 'global-toggle-case-fold-search)
        (define-key Local-map "f" 'font-lock-mode)
        (define-key Local-map "g" 'magit-status)
        (define-key Local-map "i" 'indent-buffer)
        (setq Local-map-per-user (make-keymap))
        (define-key Local-map "l" Local-map-per-user)

                                              ; Too confusing.  Force me to go into news or read-mail prior to sending.
                                              ; (define-key Local-map "m" 'other-or-make-gnus-window)

        (define-key Local-map "s" '(lambda ()
                                     (interactive)
                                     (speedbar-frame-mode nil)))
        (define-key Local-map "t" 'tags-function)
        (define-key Local-map "{" 'shrink-window)
        (define-key Local-map "}" 'enlarge-window)
        (define-key Local-map "=" 'where-am-i)
        (define-key Local-map "\C-A" 'add-varying-numbers)
        (define-key Local-map "\C-B" 'c-backward-function)
      ;;  (define-key Local-map "\C-C" 'x-copy-primary-selection)
        (define-key Local-map "\C-D" 'gdb)
        (define-key Local-map "\C-F" 'c-forward-function)
        (define-key Local-map "\C-G" 'goto-line)
        (define-key Local-map (kbd "DEL") 'move-to-first-line-of-window)
        (define-key Local-map "\C-I" 'c-indent-variable)
        (define-key Local-map "\C-K" 'kill-1-line)
        (define-key Local-map "\C-L" 'move-to-last-line-of-window)
        (define-key Local-map "\C-M" 'move-to-middle-of-window)
        (define-key Local-map "\C-N" 'funcs-next-buffer)
        (define-key Local-map "\C-O" 'occur)
        (define-key Local-map "\C-P" '(lambda ()
                                        (interactive)
                                        (if (y-or-n-p
                                             "Confirm: Print current buffer? ")
                                            (lpr-buffer)
                                          (message ""))))
        (define-key Local-map "\C-Q" 'quoted-insert)
        (define-key Local-map "\C-R" 'rename-buffer)
        (define-key Local-map "\C-S" '(lambda ()
                                        (interactive)
                                        (beep)
                                        (message "Use M-1 - M-9 instead")))
        (define-key Local-map "\C-V" 'x-yank-clipboard-selection)
        (define-key Local-map "\C-W" 'kill-region)
   ;;     (define-key Local-map "\C-X" 'x-kill-primary-selection)
        (define-key Local-map "\C-Z" 'suspend-emacs)
        (global-unset-key "\C-q")
        (define-key global-map "\C-q" Local-map)

        (define-key Local-map "\M-i" 'c-set-variable-column)
        (define-key Local-map "\M-b" 'hexl-find-file)
   ;;     (define-key Local-map "\M-c" 'x-copy-primary-selection)
   ;;     (define-key Local-map "\M-l" 'show-region)
        (define-key Local-map "\M-r" 'rectangle)
        (define-key Local-map "\M-w" 'what-line)
        (define-key Local-map "\M-v" 'x-yank-clipboard-selection)
        (define-key Local-map "\M-%" 'query-replace-regexp)
        (define-key Local-map "\M-$" 'spell-buffer)
        (define-key Local-map "\M-\\" 'strip-leading-white-space)
        )

      (fset 'quit-command "\007")  ; Keyboard-quit doesn't quit in minibuffer


      ;;; isearch key bindings
      (define-key isearch-mode-map    "\C-h"   'isearch-delete-char)

      ;; use ^H as the rubout character
      (defun keybind-swap-delete-and-backspace ()
        (interactive)

        ;;; Use this in xemacs 19.14

        (keyboard-translate ?\177 ?\C-h)
        (keyboard-translate ?\C-h ?\177))

      (defun kb-generic-shell-mode-hooker ()
        (interactive)

        (define-key shell-mode-map "\C-Q\C-C"
          '(lambda ()
             (interactive)
             (kill-region (point-min) (point-max))
             (comint-send-input)
             (message " All lines killed in this buffer.")))

        (define-key shell-mode-map "\C-Q\C-S"
          'switch-to-number-shell-or-buffer-previous))

      (defvar keybind-shell-mode-hooker nil)   ; defined in term/kb-<termtype>.el

      (keybind-init)
      (keybind-swap-delete-and-backspace)
   #+END_SRC

