init.org
** Misc stuff

   #+BEGIN_SRC emacs-lisp
;;   (keybind-init)
;;   (keybind-swap-delete-and-backspace)

                                           ; Display time in mode line
   (display-time)

                                           ; Reset modeline-format to have time and mail flag first on mode line
   (setq-default modeline-format '(" %* " global-mode-string " %n  " mode-line-buffer-identification "  " (-3 . "%p") "  %f  %[(" mode-name mode-line-process ")%]  %-"))

                                           ; Only display 24-hour time
   (setq display-time-form-list (list '24-hours 'minutes))

   (garbage-collect)

   (put 'eval-expression 'disabled nil)
   (put 'narrow-to-region 'disabled nil)
   (put 'upcase-region 'disabled t)
   #+END_SRC

** From traditional .emacs
   #+BEGIN_SRC emacs-lisp
   (custom-set-variables
    ;; custom-set-variables was added by Custom.
    ;; If you edit it by hand, you could mess it up, so be careful.
    ;; Your init file should contain only one such instance.
    ;; If there is more than one, they won't work right.
    '(display-time-mode t)
    '(indent-tabs-mode nil)
    '(js-indent-level 2)
    '(js2-auto-indent-p t)
    '(js2-basic-offset 2)
    '(js2-bounce-indent-p t)
    '(js2-enter-indents-newline t)
    '(js2-global-externs
      (quote
       ("qx" "console" "require" "module" "Buffer" "location" "document" "window")))
    '(js2-indent-on-enter-key t)
    '(js2-missing-semi-one-line-override nil)
    '(js2-mode-escape-quotes nil)
    '(json-reformat:indent-width 2 t)
                                           ;     '(package-selected-packages (quote (projectile magit js2-mode)))
                                           ;    '(save-place t nil (saveplace))
    '(show-paren-mode t)
                                           ;     '(tool-bar-mode nil)
    )
                                           ;    (custom-set-faces
                                           ;     ;; custom-set-faces was added by Custom.
                                           ;     ;; If you edit it by hand, you could mess it up, so be careful.
                                           ;     ;; Your init file should contain only one such instance.
                                           ;     ;; If there is more than one, they won't work right.
                                           ;     '(font-lock-comment-face ((((class color) (min-colors 88) (background light)) (:foreground "DarkRed"))))
                                           ;     '(font-lock-doc-face ((t (:foreground "DarkRed"))))
                                           ;     '(font-lock-type-face ((((class color) (min-colors 88) (background light)) (:foreground "DarkCyan"))))
                                           ;     '(region ((t (:background "dark khaki" :distant-foreground "gtk_selection_fg_color")))))
   (setq enable-local-eval 'maybe)		; query before eval in Local Variables:
   (setq enable-local-variables 'maybe)	; query before setting variables

                                           ;    (put 'eval-expression 'disabled nil)

   (setq default-fill-column
         (- (frame-width) 2))

                                           ;    (setq browse-url-browser-function 'browse-url-kde)

                                           ;    (font-lock-mode)

   (setq json-reformat:indent-width 2)
   (put 'downcase-region 'disabled nil)
   #+END_SRC

In emacs21, `shell` started opening in a new window. This advice
puts it into the same window.

Open up a new window. We're nearly done.

   #+BEGIN_SRC emacs-lisp
   (defun shell-same-window-advice (orig-fn &optional buffer)
     "Advice to make `shell' reuse the current window.

   Intended as :around advice."
     (let* ((buffer-regexp
             (regexp-quote
              (cond ((bufferp buffer)  (buffer-name buffer))
                    ((stringp buffer)  buffer)
                    (:else             "*shell*"))))
            (display-buffer-alist
             (cons `(,buffer-regexp display-buffer-same-window)
                   display-buffer-alist)))
       (funcall orig-fn buffer)))

   (advice-add 'shell :around #'shell-same-window-advice)

   (switch-shell 1)
   (garbage-collect)
   #+END_SRC

* Recent additions
  #+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c c") 'org-capture)
  (global-set-key (kbd "C-c o")
                  (lambda () (interactive) (find-file
                                            org-default-notes-file)))
  (setq
   org-default-notes-file "/home/derrell/ME/SyncThing/Inbox.org"
   org-refile-targets '((org-agenda-files :maxlevel . 2))
   org-catch-invisible-edits 'smart
   org-agenda-files
   '("~/ME/SyncThing/Inbox.org"
     "~/ME/SyncThing/Work.org"
     "~/ME/SyncThing/Play.org"
     "~/ME/SyncThing/Phone.org"
     "~/ME/SyncThing/Projects.org")
   org-enforce-todo-dependencies t
   org-agenda-start-day "+0d"
   org-agenda-span 3
   org-agenda-custom-commands
        '(("n" "Agenda and all TODOs"
          ((agenda #1="")
           (alltodo #1#)
           (stuck #1#)
           )))
   org-capture-templates
   '(      
     ("c" "Comment"
      entry (file org-default-notes-file)
      "* %?   %u\n")

     ("t" "Todo"
      entry (file org-default-notes-file)
      "* TODO %?   %u\n")

     ("l" "Todo w/ Context link and region"
      entry (file org-default-notes-file)
      "* TODO %? %U\n  %i\n  Link: %a")

     ("m" "Minimal note"
      entry (file org-default-notes-file)
      "* %?") 
     )       
   )

  ;; (setq org-super-agenda-groups
  ;;      '(
  ;;        (:name "Deadline"
  ;;               :and (:deadline past)
  ;;               )
  ;;        (:name "Daily Habits"
  ;;               :time-grid t
  ;;               :and (:tag "daily" :and (:tag "recurring"))
  ;;               )
  ;;        (:name "Scheduled"
  ;;         :auto-planning t
  ;;         :time-grid t)
  ;;        ))
  #+END_SRC

  Automatically revert =org-mode=-buffers when the file changes on disk.

  #+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook 'auto-revert-mode)
  #+END_SRC

  Automaticly save =org-mode=-buffers when they change

  #+BEGIN_SRC emacs-lisp
  (require 'real-auto-save)
  (add-hook 'org-mode-hook 'real-auto-save-mode)
  #+END_SRC

  #+BEGIN_SRC emacs-lisp
  (setq org-plantuml-jar-path
        (expand-file-name "/home/derrell/.emacs.d/plantuml.jar"))
  (add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
  (org-babel-do-load-languages 'org-babel-load-languages '((plantuml . t)))
  #+END_SRC

  Add the Beamer exporter
  #+BEGIN_SRC emacs-lisp
  (require 'ox-beamer)
  (require 'ox-latex)
  (setq org-export-allow-bind-keywords t)
  (setq org-latex-listings 'minted)
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((shell . t)
     (python . t)
     (C . t)
     (ruby . t)
     (js . t)
     (ditaa . t)
     ))
  (setq
   org-ditaa-jar-path "/usr/share/ditaa/ditaa.jar"
   org-latex-pdf-process
   '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
     "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
     "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  #+END_SRC

* License

  My Emacs configurations written in Org mode.

  Copyright (c) 2013 - 2020 Lars Tveito
  Copyright (c) 2020        Derrell Lipman

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.
