init.el
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(display-time-mode t)
 '(indent-tabs-mode nil)
 '(js-indent-level 2)
 '(js2-auto-indent-p t)
 '(js2-basic-offset 2)
 '(js2-bounce-indent-p t)
 '(js2-enter-indents-newline t)
 '(js2-global-externs
   (quote
    ("qx" "console" "require" "module" "Buffer" "location" "document" "window")))
 '(js2-indent-on-enter-key t)
 '(js2-missing-semi-one-line-override nil)
 '(js2-mode-escape-quotes nil)
 '(json-reformat:indent-width 2 t)
                                        ;     '(package-selected-packages (quote (projectile magit js2-mode)))
                                        ;    '(save-place t nil (saveplace))
 '(show-paren-mode t)
                                        ;     '(tool-bar-mode nil)
 )
                                        ;    (custom-set-faces
                                        ;     ;; custom-set-faces was added by Custom.
                                        ;     ;; If you edit it by hand, you could mess it up, so be careful.
                                        ;     ;; Your init file should contain only one such instance.
                                        ;     ;; If there is more than one, they won't work right.
                                        ;     '(font-lock-comment-face ((((class color) (min-colors 88) (background light)) (:foreground "DarkRed"))))
                                        ;     '(font-lock-doc-face ((t (:foreground "DarkRed"))))
                                        ;     '(font-lock-type-face ((((class color) (min-colors 88) (background light)) (:foreground "DarkCyan"))))
                                        ;     '(region ((t (:background "dark khaki" :distant-foreground "gtk_selection_fg_color")))))
(setq enable-local-eval 'maybe)		; query before eval in Local Variables:
(setq enable-local-variables 'maybe)	; query before setting variables

                                        ;    (put 'eval-expression 'disabled nil)

(setq default-fill-column
      (- (frame-width) 2))

                                        ;    (setq browse-url-browser-function 'browse-url-kde)

                                        ;    (font-lock-mode)

(setq json-reformat:indent-width 2)
(put 'downcase-region 'disabled nil)

(defun shell-same-window-advice (orig-fn &optional buffer)
  "Advice to make `shell' reuse the current window.

Intended as :around advice."
  (let* ((buffer-regexp
          (regexp-quote
           (cond ((bufferp buffer)  (buffer-name buffer))
                 ((stringp buffer)  buffer)
                 (:else             "*shell*"))))
         (display-buffer-alist
          (cons `(,buffer-regexp display-buffer-same-window)
                display-buffer-alist)))
    (funcall orig-fn buffer)))

(advice-add 'shell :around #'shell-same-window-advice)

(switch-shell 1)
(garbage-collect)

(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c o")
                (lambda () (interactive) (find-file
                                          org-default-notes-file)))
(setq
 org-default-notes-file "/home/derrell/ME/SyncThing/Inbox.org"
 org-refile-targets '((org-agenda-files :maxlevel . 2))
 org-catch-invisible-edits 'smart
 org-agenda-files
 '("~/ME/SyncThing/Inbox.org"
   "~/ME/SyncThing/Work.org"
   "~/ME/SyncThing/Play.org")
 org-enforce-todo-dependencies t
 org-agenda-start-day "+0d"
 org-agenda-span 3
 org-agenda-custom-commands
      '(("n" "Agenda and all TODOs"
        ((agenda #1="")
         (alltodo #1#)
         (stuck #1#)
         )))
 org-capture-templates
 '(      
   ("c" "Comment"
    entry (file org-default-notes-file)
    "* %?   %u\n")

   ("t" "Todo"
    entry (file org-default-notes-file)
    "* TODO %?   %u\n")

   ("l" "Todo w/ Context link and region"
    entry (file org-default-notes-file)
    "* TODO %? %U\n  %i\n  Link: %a")

   ("m" "Minimal note"
    entry (file org-default-notes-file)
    "* %?") 
   )       
 )

;; (setq org-super-agenda-groups
;;      '(
;;        (:name "Deadline"
;;               :and (:deadline past)
;;               )
;;        (:name "Daily Habits"
;;               :time-grid t
;;               :and (:tag "daily" :and (:tag "recurring"))
;;               )
;;        (:name "Scheduled"
;;         :auto-planning t
;;         :time-grid t)
;;        ))

(add-hook 'org-mode-hook 'auto-revert-mode)

(require 'real-auto-save)
(add-hook 'org-mode-hook 'real-auto-save-mode)

(setq org-plantuml-jar-path
      (expand-file-name "/home/derrell/.emacs.d/plantuml.jar"))
(add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
(org-babel-do-load-languages 'org-babel-load-languages '((plantuml . t)))

(require 'ox-beamer)
(require 'ox-latex)
(setq org-export-allow-bind-keywords t)
(setq org-latex-listings 'minted)
(add-to-list 'org-latex-packages-alist '("" "minted"))
(org-babel-do-load-languages
 'org-babel-load-languages
 '((shell . t)
   (python . t)
   (C . t)
   (ruby . t)
   (js . t)
   (ditaa . t)
   ))
(setq
 org-ditaa-jar-path "/usr/share/ditaa/ditaa.jar"
 org-latex-pdf-process
 '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
   "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
   "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
